---
kind: method
id: M:Autodesk.Revit.DB.CategoryNameMap.#ctor
source: html/b2e0b3bc-5f98-eb38-69b3-1b82072c4429.htm
---
# Autodesk.Revit.DB.CategoryNameMap.#ctor Method

Initializes a new instance of the CategoryNameMap class

## Syntax (C#)
```csharp
public CategoryNameMap()
```